app/controllers/animals_controller.rb

  def create
    @animal = Animal.new(animal_params)
    @animal.owner = current_user
    if @animal.save
---
INSERT INTO "animals" ("specie", "size", "location", "name", "sex", "health_castrated", "health_vaccinated", "health_dewormed", "health_special", "user_id", "created_at", "updated_at", "description") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

  def update
    if @animal.update(animal_params)
---
UPDATE "animals" SET "name" = $1, "updated_at" = $2 WHERE "animals"."id" = $3  [["name", "Lucas12"], ["updated_at", "2020-11-24 17:28:29.161408"], ["id", 2]]

  def destroy
    @animal.destroy
---
DELETE FROM "animals" WHERE "animals"."id" = $1  [["id", 1]]

  def set_animal
    @animal = Animal.find(params[:id])
---
SELECT "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]