app/controllers/pages_controller.rb

  def home
    @animals = Animal.all
---
SELECT "animals".* FROM "animals"

  def search
  	specie_params = params[:specie]
  	@animals = Animal.all.where(specie: specie_params)
---
SELECT "animals".* FROM "animals" WHERE "animals"."specie" = $1  [["specie", "Gato"]]